Revit 2024 API
HVACLoadType Class
 The base class for building type and space type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class HVACLoadType : Element
Visual Basic
Public Class HVACLoadType _
	Inherits Element
Visual C++
public ref class HVACLoadType : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.HVACLoadType
 Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
 Autodesk.Revit.DB.Analysis.HVACLoadSpaceType
See Also
HVACLoadType Members
Autodesk.Revit.DB.Analysis Namespace